import { Prisma } from '@prisma/client';

export interface DepartmentData extends Prisma.DepartmentCreateInput {
  codes: string[];
}

export const departments: DepartmentData[] = [
  { name: 'ส่วนกลาง', code: '00', codes: ['00', '0100'] },
  { name: 'วิศวกรรมโทรคมนาคม', code: '01', codes: ['01', '0101'] },
  { name: 'วิศวกรรมไฟฟ้า', code: '02', codes: ['02', '0102'] },
  { name: 'วิศวกรรมอิเล็กทรอนิกส์', code: '04', codes: ['04', '0104'] },
  { name: 'วิศวกรรมการวัดคุม', code: '06', codes: ['06', '0106'] },
  { name: 'วิศวกรรมเครื่องกล', code: '05', codes: ['05', '0105'] },
  { name: 'วิศวกรรมคอมพิวเตอร์', code: '07', codes: ['07', '0107'] },
  { name: 'วิศวกรรมระบบควบคุม', code: '08', codes: ['08', '0108'] },
  { name: 'วิศวกรรมโยธา', code: '09', codes: ['09', '0109'] },
  { name: 'วิศวกรรมเกษตร', code: '10', codes: ['10', '0110'] },
  { name: 'วิศวกรรมอาหาร', code: '11', codes: ['11', '0111'] },
  { name: 'วิศวกรรมเคมี', code: '12', codes: ['22', '0122'] },
  { name: 'วิศวกรรมคนตรีและสื่อประสม', code: '13', codes: ['13', '0113'] },
  { name: 'วิศวกรรมพลังงานไฟฟ้า', code: '14', codes: ['14', '0114'] },
  { name: 'วิชาเสรีทั่วไป', code: '90', codes: ['90', '901', '902', '903', '904', '905', '906', '966'] },
  { name: 'วิชาเสรีทั่วไป', code: 'GENED', codes: ['901', '902', '903', '904', '905', '906', '966'] },
  { name: 'วิศวกรรมปิโตรเคมี', code: '20', codes: ['20', '0120'] },
  { name: 'วิศวกรรมอุตสาหการ', code: '21', codes: ['21', '0121'] },
  { name: 'วิศวกรรมระบบไอโอทีและสารสนเทศ', code: '23', codes: ['23', '0123'] },
  { name: 'วิศวกรรมแมคคาทรอนิกส์', code: '24', codes: ['24', '0124'] },
  { name: 'วิศวกรรมอัตโนมัติ', code: '25', codes: ['25', '0125'] },
  { name: 'วิศวกรรมนวัตกรรมคอมพิวเตอร์', code: '26', codes: ['26', '0126'] },
  { 
    name: 'วิศวกรรมคอมพิวเตอร์(นานาชาติ)', 
    code: '27', 
    codes: ['27','0127', '1300', '1301'] 
  },
  { name: 'วิศวกรรมซอฟต์แวร์', code: '28', codes: ['28', '0128'] },
  { name: 'วิศวกรรมไฟฟ้า(นานาชาติ)', code: '30', codes: ['30', '0130'] },
  { name: 'วิศวกรรมโยธา(นานาชาติ)', code: '32', codes: ['32', '0132'] },
  { name: 'วิศวกรรมไฟฟ้าสื่อสารและอิเล็กทรอนิกส์', code: '34', codes: ['34', '0134'] },
  { name: 'วิศวกรรมอุตสาหการ(นานาชาติ)', code: '35', codes: ['35', '0135'] },
  { name: 'วิศวกรรมเคมี(นานาชาติ)', code: '36', codes: ['36', '0136'] },
  { name: 'วิศวกรรมโยธา(ต่อเนื่อง)', code: '37', codes: ['37', '0137'] },
  { name: 'วิศวกรรมเกษตร(ต่อเนื่อง)', code: '38', codes: ['38', '0138'] },
  { name: 'วิศวกรรมอวกาศและภูมิสารสนเทศ', code: '40', codes: ['40', '0140'] },
  { name: 'วิศวกรรมหุ่นยนต์และปัญญาประดิษฐ์', code: '41', codes: ['41', '0141'] },
  { name: 'วิศวกรรมเครื่องกล(นานาชาติ)', code: '42', codes: ['42', '0142'] },
  { name: 'วิศวกรรมไฟฟ้า(ต่อเนื่อง)', code: '45', codes: ['45', '0145'] },
  { name: 'วิศวกรรมพลังงาน', code: '51', codes: ['51', '0151'] },
  { name: 'วิศวกรรมการเงิน', code: '52', codes: ['52', '0152'] },
  { name: 'วิศวกรรมและการเป็นผู้ประกอบการ', code: '53', codes: ['53', '0153'] },
  { name: 'วิศวกรรม-ชีวการแพทย์', code: '92', codes: ['92', '33', '0192', '0133'] },
  { name: 'ไม่มีภาควิชา', code: '99', codes: ['99'] },
  { 
    name: 'วิศวกรรมสหวิทยาการนานาชาติ (SIIE)', 
    code: '01006710', 
    codes: ['01006015', '01006710', '01006717', '01006718', '01006730', '01286111', '01006801', '01006715', '01006813', '01006803', '01006719', '01286222', '01006719', '01006804', '01006723', '01006727'] 
  },
];

export function getDepartmentByCode(code: string): DepartmentData | undefined {
  return departments.find(dept => dept.codes.includes(code));
}