import { Prisma } from '@prisma/client';

export interface DepartmentData extends Prisma.DepartmentCreateInput {
  codes: string[];
}

export const departments: DepartmentData[] = [
  { name: 'วิศวกรรมโทรคมนาคม', code: '01', codes: ['01', '0101', '34', '0134'] },
  { name: 'วิศวกรรมไฟฟ้า', code: '02', codes: ['02', '0102', '30', '0130', '45', '0145', '51', '0151', '14', '0114'] },
  { name: 'วิศวกรรมอิเล็กทรอนิกส์', code: '04', codes: ['04', '0104'] },
  { name: 'วิศวกรรมการวัดคุม', code: '06', codes: ['06', '0106', '92', '0192', '08', '0108', '25', '0125', '24', '0124'] },
  { name: 'วิศวกรรมเครื่องกล', code: '05', codes: ['05', '0105', '42', '0142'] },
  { name: 'วิศวกรรมคอมพิวเตอร์', code: '07', codes: ['07', '0107', '28', '27', '0127', '1301', '26', '0126', '52', '0152', '23', '0123', '13', '0113'] },
  { name: 'วิศวกรรมโยธา', code: '09', codes: ['09', '0109', '32', '0132', '37', '0137', '53', '0153'] },
  { name: 'วิศวกรรมเกษตร', code: '10', codes: ['10', '0110', '38', '0138', '40', '0140'] },
  { name: 'วิศวกรรมอาหาร', code: '11', codes: ['11', '0111'] },
  { name: 'วิศวกรรมเคมี', code: '12', codes: ['22', '0122', '36', '0136', '20', '0120', '12', '0112'] },
  { name: 'วิศวกรรมหุ่นยนต์และปัญญาประดิษฐ์', code: '41', codes: ['41', '0141'] },
  { name: 'วิศวกรรมอุตสาหการ', code: '21', codes: ['21', '0121', '35', '0135'] },
  { name: 'วิศวกรรมชีวการแพทย์', code: '33', codes: ['33', '0133',] }, 
  { 
    name: 'วิศวกรรมสหวิทยาการนานาชาติ (SIIE)', 
    code: '01006710', 
    codes: ['01006015', '01006710', '01006717', '01006718', '01006730', '01286111', '01006801', '01006715', '01006813', '01006803', '01006719', '01286222', '01006719', '01006804', '01006723', '01006727'] 
  },
  { name: 'วิชาเสรีทั่วไป', code: 'GENED', codes: ['901', '902', '903', '904', '905', '906', '966', '00', '0100'] },
  { name: 'ไม่มีภาควิชา', code: '99', codes: ['99'] },
];

export function getDepartmentByCode(code: string): DepartmentData | undefined {
  return departments.find(dept => dept.codes.includes(code));
}