import { Prisma } from '@prisma/client';

export const departments: Prisma.DepartmentCreateInput[] = [
  { name: 'ส่วนกลาง', code: '00' },
  { name: 'วิศวกรรมโทรคมนาคม', code: '01' },
  { name: 'วิศวกรรมไฟฟ้า', code: '02' },
  { name: 'วิศวกรรมอิเล็กทรอนิกส์', code: '04' },
  { name: 'วิศวกรรมการวัดคุม', code: '06' },
  { name: 'วิศวกรรมเครื่องกล', code: '05' },
  { name: 'วิศวกรรมคอมพิวเตอร์', code: '07' },
  { name: 'วิศวกรรมโยธา', code: '09' },
  { name: 'วิศวกรรมเกษตร', code: '10' },
  { name: 'วิศวกรรมอาหาร', code: '11' },
  { name: 'วิศวกรรมเคมี', code: '12' },
  { name: 'วิชาเสรีทั่วไป', code: '90' },
  { name: 'วิศวกรรมปิโตรเคมี', code: '20' },
  { name: 'วิศวกรรมอุตสาหการ', code: '21' },
  { name: 'วิศวกรรมเกษตร(ต่อเนื่อง)', code: '38' },
  { name: 'วิศวกรรมไฟฟ้า(ต่อเนื่อง)', code: '45' },
  { name: 'วิศวกรรมโยธา(ต่อเนื่อง)', code: '37' }
];